Revit 2024 API
SelectableInViewFilter Members
The SelectableInViewFilter type exposes the following members.
Constructors
Name | Description
SelectableInViewFilter(Document, ElementId)
 Constructs a new instance of an SelectableInViewFilter.
SelectableInViewFilter(Document, ElementId, Boolean)
 Constructs a new instance of an SelectableInViewFilter, with the option to pass all non-selectable elements.
Methods
Name | Description
Dispose |  (Inherited from ElementFilter.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
PassesFilter(Element)
 Applies the filter to a given element.
 (Inherited from ElementFilter.)
PassesFilter(Document, ElementId)
 Applies the filter to a given element.
 (Inherited from ElementFilter.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Inverted
 True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.
 (Inherited from ElementFilter.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from ElementFilter.)
See Also
SelectableInViewFilter Class
Autodesk.Revit.UI.Selection Namespace